test/fixtures/subscriptions.json

[{
  "amount":"44.0",
  "interval_length":1,
  "interval_unit":"month",
  "created_at":"2011-09-12T13:51:30Z",
  "currency":"GBP",
  "name":"London Gym Membership",
  "description":"Entitles you to use all of the gyms around London",
  "expires_at":null,
  "next_interval_start":"2011-10-12T13:51:30Z",
  "id": "123ABC",
  "merchant_id":"123ABCDEF",
  "status":"active",
  "user_id":"9876XYZ",
  "uri":"https://gocardless.com/api/v1/subscriptions/123ABC",
  "sub_resource_uris":{
    "bills":"https://gocardless.com/api/v1/merchants/123ABCDEF/bills?source_id=123ABC"
  }
}]
